fast_finish_2026/LR4/Re_41/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.01;

// Projected cylinder area for the inherited force-coefficient function object.
diameter 0.01;
projArea 0.0001;

vertices
(
    (-10 -5  0.5)  // 0
    ( -5 -5  0.5)  // 1
    ( -5  5  0.5)  // 2
    (-10  5  0.5)  // 3
    (-10 -5 -0.5)  // 4
    ( -5 -5 -0.5)  // 5
    ( -5  5 -0.5)  // 6
    (-10  5 -0.5)  // 7
    (  5 -5  0.5)  // 8
    ( 50 -5  0.5)  // 9
    ( 50  5  0.5)  // 10
    (  5  5  0.5)  // 11
    (  5 -5 -0.5)  // 12
    ( 50 -5 -0.5)  // 13
    ( 50  5 -0.5)  // 14
    (  5  5 -0.5)  // 15
    (-0.353553391 -0.353553391  0.5) // 16
    ( 0.353553391 -0.353553391  0.5) // 17
    ( 0.353553391  0.353553391  0.5) // 18
    (-0.353553391  0.353553391  0.5) // 19
    (-0.353553391 -0.353553391 -0.5) // 20
    ( 0.353553391 -0.353553391 -0.5) // 21
    ( 0.353553391  0.353553391 -0.5) // 22
    (-0.353553391  0.353553391 -0.5) // 23
);

blocks
(
    hex (0 1 5 4 3 2 6 7) (30 1 30) simpleGrading (1 1 1)
    hex (1 8 12 5 16 17 21 20) (30 1 30) simpleGrading (1 1 1)
    hex (1 16 20 5 2 19 23 6) (30 1 30) simpleGrading (1 1 1)
    hex (19 18 22 23 2 11 15 6) (30 1 30) simpleGrading (1 1 1)
    hex (17 8 12 21 18 11 15 22) (30 1 30) simpleGrading (1 1 1)
    hex (8 9 13 12 11 10 14 15) (200 1 30) simpleGrading (1 1 1)
);

edges
(
    arc 16 17 (0 -0.5  0.5)
    arc 21 20 (0 -0.5 -0.5)
    arc 19 16 (-0.5 0  0.5)
    arc 23 20 (-0.5 0 -0.5)
    arc 19 18 (0  0.5  0.5)
    arc 23 22 (0  0.5 -0.5)
    arc 18 17 (0.5 0  0.5)
    arc 22 21 (0.5 0 -0.5)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    outlet
    {
        type patch;
        faces ((9 13 14 10));
    }
    wall
    {
        type wall;
        faces
        (
            (3 2 6 7)
            (2 11 15 6)
            (11 10 14 15)
            (0 1 5 4)
            (1 8 12 5)
            (8 9 13 12)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (19 18 22 23)
            (16 19 23 20)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 16 19 2)
            (19 18 11 2)
            (17 8 11 18)
            (1 8 17 16)
            (8 9 10 11)
            (4 7 6 5)
            (5 6 23 20)
            (23 6 15 22)
            (21 22 15 12)
            (5 20 21 12)
            (12 15 14 13)
        );
    }
);

// ************************************************************************* //
