fast_finish_2026/LR4/Re_41/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible; i.e., pressure is kinematic and has
    units of m^2/s^2.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/forces/forcesIncompressible.cfg"

patches     (cylinder);
rhoInf      1.225;
CofR        (0 0 0);
pitchAxis   (0 1 0);

// ************************************************************************* //
